<a href="https://colab.research.google.com/github/03dipak/practise-pandas-ml/blob/master/06_Stats/US_Baby_Names/Exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [0]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [5]:
baby_names = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv",sep=',')
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
del baby_names['Unnamed: 0']
del baby_names['Id']
baby_names.tail()

            Name  Year Gender State  Count
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

### Step 6. Is there more male or female names in the dataset?

In [9]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [12]:
names = baby_names.groupby('Name').sum()

names.sort_values('Count',ascending=False)[['Count']]

              Count
Name
Jacob        242874
Emma         214852
Michael      214405
Ethan        209277
Isabella     204798
William      197894
Joshua       191551
Sophia       191446
Daniel       191440
Emily        190318
Olivia       188036
Alexander    187189
Matthew      185279
Noah         179925
Anthony      179256
Andrew       174975
Christopher  172997
Joseph       169972
David        167606
Ava          167369
Madison      166959
Jayden       166864
James        162429
Logan        158186
Ryan         156507
Abigail      156236
Mason        149221
Benjamin     145867
Aiden        145774
Elijah       142851
...             ...
Assata            5
Siris             5
Sirus             5
Mansoor           5
Sitlali           5
Marcelle          5
Athos             5
Atiya             5
Sila              5
Emron             5
Margret           5
Emunah            5
Emya              5
Aubrea            5
Siennah           5
Marena            5
Endi              5
Atzi              5
Siler             5
Atlanta           5
Marcuz            5
Eneida            5
Enes              5
Atleigh           5
Marcjacob         5
Eniola            5
Atlantis          5
Marci             5
Simarpreet        5
Nita              5

[17632 rows x 1 columns]

### Step 8. How many different names exist in the dataset?

In [13]:
baby_names.Name.nunique()

17632

### Step 9. What is the name with most occurrences?

In [18]:
names.Count.idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [20]:
names[name.Count == name]

AttributeError: ignored

### Step 11. What is the median name occurrence?

### Step 12. What is the standard deviation of names?

### Step 13. Get a summary with the mean, min, max, std and quartiles.